# S3 - ???

In [1]:
# Bibliotecas
import os
import sqlite3 as sql
import pandas as pd

In [2]:
# Cambio de directorio
os.chdir('G:\\15_Estudio\\07 - Udemy\\SQL - Portilla Complete Bootcamp')

In [3]:
with open('UDM-SQL-BTCMP--003.sql', 'r') as file:
    query_log = file.read()
    
query_log = query_log.replace(' */', '')
query_log_lines = query_log.split('\n')

In [4]:
for i, line in enumerate(query_log_lines):
    query_log_lines[i] = line.strip()
    if line[:2] == '/*':
        query_log_lines[i] = line.replace('/*', '##')
    elif line != '':
        query_log_lines[i] = '\t' + line + ' \\'
    else:
        pass

In [5]:
for line in query_log_lines:
    print(line)

## 26. General Challenge 1
## 1. How many transactions were greater than USD 5.00?
	SELECT COUNT(*) \
	FROM payment \
	WHERE amount > 5.00; \


## 2. How many actors have a first name that starts with a letter P?
## I'm assuming case-sensitive.
	SELECT COUNT(*) \
	FROM actor \
	WHERE first_name LIKE 'P%'; \


## 3. How many unique districts are our customers from?
	SELECT COUNT(DISTINCT district) \
	FROM address; \


## 4. The names of those distinct districts
	SELECT DISTINCT district \
	FROM address; \


## 5. How many films have a rating of R and a
## replacement cost between USD 5 and USD 15?
	SELECT COUNT(*) \
	FROM film \
	WHERE rating = 'R' \
		AND replacement_cost BETWEEN 5 AND 15; \


## 6. How many films have the word Truman somewhere in title?
## I assume case-insensitive
	SELECT COUNT(*) \
	FROM film \
	WHERE title ILIKE '%Truman%'; \

## Bonus by me
	SELECT title \
	FROM film \
	WHERE title ILIKE '%Truman%'; \


## 27. Introduction to GROUP BY
## Blank/Notes


## 28. Aggregation functions
	SELECT * \
	FROM film \
	LIMIT 1; \

## Minimum film replacement cost*/
	SELECT MIN(replacement_cost) \
	FROM film; \

## Maximum film replacement cost*/
	SELECT MAX(replacement_cost) \
	FROM film; \

## Multiple agg functions can be called together, but not a full column
	SELECT MIN(replacement_cost), MAX(replacement_cost), ROUND(AVG(replacement_cost), 4) \
	FROM film; \

## Another little twist
	SELECT  \
		MIN(replacement_cost) AS Minimum, \
		MAX(replacement_cost) AS Maximum, \
		ROUND(AVG(replacement_cost), 4) AS Average \
	FROM film; \

## Replacement cost of the entire store
	SELECT SUM(replacement_cost) \
	FROM film; \


## 29. GROUP BY pt. 1
## Blank/Notes

In [6]:
# Limit removal for showing pandas.DataFrames' columns
pd.set_option('display.max_columns', None)
# Limit removal for showing pandas.DataFrames' rows
pd.set_option('display.max_rows', None)
# Modification of console with for displaying
pd.set_option('display.width', 8000)

In [7]:
# Conexión y cursor
conn = sql.connect('G:\\15_Estudio\\07 - Udemy\\SQL - Portilla Complete Bootcamp\\dvdrental.db')
cur = conn.cursor()

## 26. General Challenge 1

### 1. How many transactions were greater than USD 5.00?

In [8]:
# Consulta
query = "\
	SELECT COUNT(*) \
	FROM payment \
	WHERE amount > 5.00; \
    "
# DataFrame desde consulta
results_df = pd.read_sql_query(
    query,
    conn
)
# Impresión
print(results_df)

   COUNT(*)
0      3618

### 2. How many actors have a first name that starts with a letter P?

In [9]:
# I'm assuming case-sensitive.
# Consulta
query = "\
	SELECT COUNT(*) \
	FROM actor \
	WHERE first_name LIKE 'P%'; \
    "
# DataFrame desde consulta
results_df = pd.read_sql_query(
    query,
    conn
)
# Impresión
print(results_df)

   COUNT(*)
0         5

### 3. How many unique districts are our customers from?

In [10]:
# Consulta
query = "\
	SELECT COUNT(DISTINCT district) \
	FROM address; \
    "
# DataFrame desde consulta
results_df = pd.read_sql_query(
    query,
    conn
)
# Impresión
print(results_df)

   COUNT(DISTINCT district)
0                       377

### 4. The names of those distinct districts

In [11]:
# Consulta
query = "\
	SELECT DISTINCT district \
	FROM address; \
    "
# DataFrame desde consulta
results_df = pd.read_sql_query(
    query,
    conn
)
# Impresión
print(results_df.head(10))

         district
0         Alberta
1             QLD
2        Nagasaki
3      California
4          Attika
5        Mandalay
6          Nantou
7           Texas
8  Central Serbia
9        Hamilton

### 5. How many films have a rating of R and a replacement cost between USD 5 and USD 15?

In [12]:
# Consulta
query = "\
	SELECT COUNT(*) \
	FROM film \
	WHERE rating = 'R' \
		AND replacement_cost BETWEEN 5 AND 15; \
    "
# DataFrame desde consulta
results_df = pd.read_sql_query(
    query,
    conn
)
# Impresión
print(results_df)

   COUNT(*)
0        52

### 6. How many films have the word Truman somewhere in title?

In [13]:
# I assume case-insensitive
# Consulta
query = "\
	SELECT COUNT(*) \
	FROM film \
/*	WHERE title ILIKE '%Truman%'; */ \
    WHERE LOWER(title) LIKE '%truman%'; \
    "
# NOTAR que la tercera línea de la consulta usa el operador ILIKE
# que es válido en PostgreSQL, pero no en SQLite, por lo que se adapta
# mediante el uso de LOWER() y una t en lugar de una T.

# DataFrame desde consulta
results_df = pd.read_sql_query(
    query,
    conn
)
# Impresión
print(results_df)

   COUNT(*)
0         5

### Bonus by me

In [14]:
# Consulta
query = "\
	SELECT title \
	FROM film \
	WHERE LOWER(title) LIKE '%truman%'; \
    "
# Misma adaptación utilzada

# DataFrame desde consulta
results_df = pd.read_sql_query(
    query,
    conn
)
# Impresión
print(results_df)

           title
0   Agent Truman
1   Lover Truman
2   Minds Truman
3  Mystic Truman
4   Truman Crazy

## 27. Introduction to GROUP BY

Blank/In notes

## 28. Aggregation functions

In [15]:
# Se explora

# Consulta
query = "\
	SELECT * \
	FROM film \
	LIMIT 1; \
    "

# DataFrame desde consulta
results_df = pd.read_sql_query(
    query,
    conn
)
# Impresión
print(results_df)

   film_id            title                                        description  release_year  language_id  rental_duration  rental_rate  length  replacement_cost rating              last_update special_features                                           fulltext
0      133  Chamber Italian  A Fateful Reflection of a Moose And a Husband ...          2006            1                7         4.99     117             14.99  NC-17  2013-05-26 14:50:58.951       {Trailers}  'chamber':1 'fate':4 'husband':11 'italian':2 ...

In [16]:
# Minimum film replacement cost

# Consulta
query = "\
	SELECT MIN(replacement_cost) \
	FROM film; \
    "
# DataFrame desde consulta
results_df = pd.read_sql_query(
    query,
    conn
)
# Impresión
print(results_df)

   MIN(replacement_cost)
0                   9.99

In [17]:
## Maximum film replacement cost

# Consulta
query = "\
	SELECT MAX(replacement_cost) \
	FROM film; \
    "
# DataFrame desde consulta
results_df = pd.read_sql_query(
    query,
    conn
)
# Impresión
print(results_df)

   MAX(replacement_cost)
0                  29.99

In [18]:
# Multiple agg functions can be called together, but not a full column

# Consulta
query = "\
	SELECT MIN(replacement_cost), MAX(replacement_cost), ROUND(AVG(replacement_cost), 4) \
	FROM film; \
    "
# DataFrame desde consulta
results_df = pd.read_sql_query(
    query,
    conn
)
# Impresión
print(results_df)

   MIN(replacement_cost)  MAX(replacement_cost)  ROUND(AVG(replacement_cost), 4)
0                   9.99                  29.99                           19.984

In [19]:
# Another little twist

# Consulta
query = "\
	SELECT  \
		MIN(replacement_cost) AS Minimum, \
		MAX(replacement_cost) AS Maximum, \
		ROUND(AVG(replacement_cost), 4) AS Average \
	FROM film; \
    "
# DataFrame desde consulta
results_df = pd.read_sql_query(
    query,
    conn
)
# Impresión
print(results_df)

   Minimum  Maximum  Average
0     9.99    29.99   19.984

In [20]:
# Replacement cost of the entire store

# Consulta
query = "\
	SELECT SUM(replacement_cost) \
	FROM film; \
    "
# DataFrame desde consulta
results_df = pd.read_sql_query(
    query,
    conn
)
# Impresión
print(results_df)

   SUM(replacement_cost)
0                19984.0

## 29. GROUP BY pt. 1

Blank/In notes